# CannotToggleToPerspective Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..CannotToggleToPerspective Property
BuiltInFailures..::..ViewFailures Class See Also
---
Cannot toggle to perspective view because the view contains annotations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotToggleToPerspective { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotToggleToPerspective As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotToggleToPerspective {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace